Revit 2027 API
ParameterTypeId.StairsLandingThickness Property
 "Total Thickness": Thickness
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsLandingThickness { get; }
Public Shared ReadOnly Property StairsLandingThickness As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsLandingThickness {
	ForgeTypeId^ get ();
}
static member StairsLandingThickness : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace